<?php
function egb_text_replacement($input_text) {
    // $input_text가 null인 경우, null을 그대로 반환
    if ($input_text === null) {
        return null;
    }

    $entities = array(
        "'" => "&apos;",
        "<" => "&lt;",
        ">" => "&gt;",
        "!" => "&#33;",
        "@" => "&#64;",
        "#" => "&#35;",
        "$" => "&#36;",
        "%" => "&#37;",
        "^" => "&#94;",
        "&" => "&amp;",
        "*" => "&#42;",
        "(" => "&#40;",
        ")" => "&#41;",
        "_" => "&#95;",
        "-" => "&#45;",
        "=" => "&#61;",
        "+" => "&#43;",
        "\\" => "&#92;",
        "|" => "&#124;",
        "`" => "&#96;",
        "~" => "&#126;",
        ";" => "&#59;",
        ":" => "&#58;",
        "," => "&#44;",
        "." => "&#46;",
        '"' => "&quot;",
        "/" => "&#47;",
        "?" => "&#63;"
    );

    // 문자열에서 각각의 특수 문자를 HTML 엔티티로 변환
    $output_text = strtr($input_text, $entities);

    return $output_text;
}
?>
